cmsis-svd/cmsis-svd/data/Microchip/ATSAME51N.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PM</name>
         <version>U24061.0.0</version>
         <description>Power Manager</description>
         <groupName>PM</groupName>
         <prependToName>PM_</prependToName>
         <baseAddress>0x40000400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x13</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PM</name>
            <value>0</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>IORET</name>
                     <description>I/O Retention</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLEEPCFG</name>
               <description>Sleep Configuration</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x02</resetValue>
               <fields>
                  <field>
                     <name>SLEEPMODE</name>
                     <description>Sleep Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SLEEPMODESelect</name>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>CPU, AHBx, and APBx clocks are OFF</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STANDBY</name>
                           <description>All Clocks are OFF</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIBERNATE</name>
                           <description>Backup domain is ON as well as some PDRAMs</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BACKUP</name>
                           <description>Only Backup domain is powered ON</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>All power domains are powered OFF</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SLEEPRDY</name>
                     <description>Sleep Mode Entry Ready Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SLEEPRDY</name>
                     <description>Sleep Mode Entry Ready Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SLEEPRDY</name>
                     <description>Sleep Mode Entry Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STDBYCFG</name>
               <description>Standby Configuration</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>RAMCFG</name>
                     <description>Ram Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>RAMCFGSelect</name>
                        <enumeratedValue>
                           <name>RET</name>
                           <description>All the system RAM is retained</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PARTIAL</name>
                           <description>Only the first 32Kbytes of the system RAM is retained</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>All the system RAM is turned OFF</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FASTWKUP</name>
                     <description>Fast Wakeup</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>FASTWKUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Fast Wakeup is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NVM</name>
                           <description>Fast Wakeup is enabled on NVM</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAINVREG</name>
                           <description>Fast Wakeup is enabled on the main voltage regulator (MAINVREG)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Fast Wakeup is enabled on both NVM and MAINVREG</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HIBCFG</name>
               <description>Hibernate Configuration</description>
               <addressOffset>0x9</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>RAMCFG</name>
                     <description>Ram Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>RAMCFGSelect</name>
                        <enumeratedValue>
                           <name>RET</name>
                           <description>All the system RAM is retained</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PARTIAL</name>
                           <description>Only the first 32Kbytes of the system RAM is retained</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>All the system RAM is turned OFF</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BRAMCFG</name>
                     <description>Backup Ram Configuration</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BRAMCFGSelect</name>
                        <enumeratedValue>
                           <name>RET</name>
                           <description>All the backup RAM is retained</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PARTIAL</name>
                           <description>Only the first 4Kbytes of the backup RAM is retained</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>All the backup RAM is turned OFF</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKUPCFG</name>
               <description>Backup Configuration</description>
               <addressOffset>0xA</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>BRAMCFG</name>
                     <description>Ram Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BRAMCFGSelect</name>
                        <enumeratedValue>
                           <name>RET</name>
                           <description>All the backup RAM is retained</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PARTIAL</name>
                           <description>Only the first 4Kbytes of the backup RAM is retained</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>All the backup RAM is turned OFF</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWSAKDLY</name>
               <description>Power Switch Acknowledge Delay</description>
               <addressOffset>0x12</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DLYVAL</name>
                     <description>Delay Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>IGNACK</name>
                     <description>Ignore Acknowledge</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
