cmsis-svd/cmsis-svd/data/Microchip/ATSAME51N.svd
               <register>
                  <name>CTRLC</name>
                  <description>USART_INT Control C</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>GTIME</name>
                        <description>Guard Time</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>BRKLEN</name>
                        <description>LIN Master Break Length</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>BRKLENSelect</name>
                           <enumeratedValue>
                              <name>13_BIT</name>
                              <description>Break field transmission is 13 bit times</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>17_BIT</name>
                              <description>Break field transmission is 17 bit times</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>21_BIT</name>
                              <description>Break field transmission is 21 bit times</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>26_BIT</name>
                              <description>Break field transmission is 26 bit times</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>HDRDLY</name>
                        <description>LIN Master Header Delay</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>HDRDLYSelect</name>
                           <enumeratedValue>
                              <name>DELAY0</name>
                              <description>Delay between break and sync transmission is 1 bit time; Delay between sync and ID transmission is 1 bit time</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DELAY1</name>
                              <description>Delay between break and sync transmission is 4 bit time; Delay between sync and ID transmission is 4 bit time</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DELAY2</name>
                              <description>Delay between break and sync transmission is 8 bit time; Delay between sync and ID transmission is 4 bit time</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DELAY3</name>
                              <description>Delay between break and sync transmission is 14 bit time; Delay between sync and ID transmission is 4 bit time</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>INACK</name>
                        <description>Inhibit Not Acknowledge</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DSNACK</name>
                        <description>Disable Successive NACK</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MAXITER</name>
                        <description>Maximum Iterations</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>DATA32B</name>
                        <description>Data 32 Bit</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>DATA32BSelect</name>
                           <enumeratedValue>
                              <name>DATA_READ_WRITE_CHSIZE</name>
                              <description>Data reads and writes according CTRLB.CHSIZE</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DATA_READ_CHSIZE_WRITE_32BIT</name>
                              <description>Data reads according CTRLB.CHSIZE and writes according 32-bit extension</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DATA_READ_32BIT_WRITE_CHSIZE</name>
                              <description>Data reads according 32-bit extension and writes according CTRLB.CHSIZE</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DATA_READ_WRITE_32BIT</name>
                              <description>Data reads and writes according 32-bit extension</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD</name>
                  <description>USART_INT Baud Rate</description>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD_FRAC_MODE</name>
                  <description>USART_INT Baud Rate</description>
                  <alternateRegister>BAUD</alternateRegister>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                     <field>
                        <name>FP</name>
                        <description>Fractional Part</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD_FRACFP_MODE</name>
                  <description>USART_INT Baud Rate</description>
                  <alternateRegister>BAUD</alternateRegister>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                     <field>
                        <name>FP</name>
                        <description>Fractional Part</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD_USARTFP_MODE</name>
                  <description>USART_INT Baud Rate</description>
                  <alternateRegister>BAUD</alternateRegister>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXPL</name>
                  <description>USART_INT Receive Pulse Length</description>
                  <addressOffset>0xE</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>RXPL</name>
                        <description>Receive Pulse Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>USART_INT Interrupt Enable Clear</description>
                  <addressOffset>0x14</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty Interrupt Disable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete Interrupt Disable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete Interrupt Disable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXS</name>
                        <description>Receive Start Interrupt Disable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTSIC</name>
                        <description>Clear To Send Input Change Interrupt Disable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXBRK</name>
                        <description>Break Received Interrupt Disable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt Disable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>USART_INT Interrupt Enable Set</description>
                  <addressOffset>0x16</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXS</name>
                        <description>Receive Start Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTSIC</name>
                        <description>Clear To Send Input Change Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXBRK</name>
                        <description>Break Received Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>USART_INT Interrupt Flag Status and Clear</description>
                  <addressOffset>0x18</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty Interrupt</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete Interrupt</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete Interrupt</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXS</name>
                        <description>Receive Start Interrupt</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTSIC</name>
                        <description>Clear To Send Input Change Interrupt</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXBRK</name>
                        <description>Break Received Interrupt</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>USART_INT Status</description>
                  <addressOffset>0x1A</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>PERR</name>
                        <description>Parity Error</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FERR</name>
                        <description>Frame Error</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUFOVF</name>
                        <description>Buffer Overflow</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTS</name>
                        <description>Clear To Send</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ISF</name>
                        <description>Inconsistent Sync Field</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>COLL</name>
                        <description>Collision Detected</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXE</name>
                        <description>Transmitter Empty</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ITER</name>
                        <description>Maximum Number of Repetitions Reached</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>USART_INT Synchronization Busy</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>SERCOM Enable Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTRLB</name>
                        <description>CTRLB Synchronization Busy</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXERRCNT</name>
                        <description>RXERRCNT Synchronization Busy</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LENGTH</name>
                        <description>LENGTH Synchronization Busy</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXERRCNT</name>
                  <description>USART_INT Receive Error Count</description>
                  <addressOffset>0x20</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>RXERRCNT</name>
                        <description>Receive Error Count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LENGTH</name>
                  <description>USART_INT Length</description>
                  <addressOffset>0x22</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>LEN</name>
                        <description>Data Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>LENEN</name>
                        <description>Data Length Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA</name>
                  <description>USART_INT Data</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DATA</name>
                        <description>Data Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
